let keywords = [
    {
        keywordsId:1,
        keywords:["Kwun-B37H","KwunB37H","B37H","37H","堒-B37H"],
        message:"我们很高兴向您介绍我们的产品Kwun-B37H，它是一款具有出色性能和功能的清洁机器人。该产品的产品版本为Kwun-B37H，被赋予了昵称 '清洁霸主，沙尘暴克星'。它采用自主的清洁方法，拥有卓越的清洁能力和多项出色特点。\n" +
            "\n" +
            "Kwun-B37H的主要特点包括：清洁效率高达650平方米/小时，续航时间达3小时，充电时间仅需3小时，能够适应水洗和干刷工作，水洗角度可达15度，干刷角度可达20度。其机身尺寸为585560250mm，机身重量为23.85KG。此外，它还具备出色的抗风能力，可以在风速为62-74km/h（干刷）和29-38km/h（水洗）的条件下工作。\n" +
            "\n" +
            "Kwun-B37H的设计寿命为6年，享有1年或2400小时的保修期。它搭载15Ah电池，续航时间为3小时，充电时间也只需3小时。特别值得一提的是，它支持夜间作业，能够保证电站的连续发电。此外，我们的产品还具备强大的清洁能力，包括浮力达到99%、灰尘积累达95%、干燥鸟粪清洁效率高达85%。\n" +
            "\n" +
            "Kwun-B37H采用先进的技术，包括基于TianyunOS操作系统、Glass vSLAM®视觉导航技术、Goodzenn®路径规划技术以及AI-Kwun操作平台。它支持最多24台机器的单人操作，也可用于斜坡和屋顶的清洁。此外，我们提供OTA升级、远程控制、无人机部署等功能。\n" +
            "\n" +
            "安全性方面，Kwun-B37H采用AI视觉语义定位、高精度吸附转向机、AI视觉语义+超声波防摔保护等技术，确保操作安全。产品的防盗位置终端精度在中国境内不超过10米，具有IP65防护等级，且通过了必维隐裂认证。\n" +
            "\n" +
            "Kwun-B37H是一款为大型地面集中式电站设计的创新产品，为您提供高效的清洁解决方案。如果您对我们的产品有任何疑问或需要进一步了解，请随时联系我们。",
    },
    {
        keywordsId:1,
        keywords:["Kwun-B37L","KwunB37L","B37L","37L","堒-B37L"],
        message:"\"Kwun-B37L\" 是一款高性能的清洁机器人，具有多项关键参数，如下：\n" +
            "\n" +
            "产品版本: 堒® B37L\n" +
            "介绍: 3系大角度 高功率\n" +
            "转动方法: 自主\n" +
            "昵称: 清洁霸主，沙尘暴克星\n" +
            "价格: 520,178 元\n" +
            "主要能力：\n" +
            "\n" +
            "清洁效率: ≥600平方米/小时\n" +
            "续航时间: 3小时\n" +
            "充电时间: 3小时\n" +
            "水洗角度: ≤15°\n" +
            "干刷角度: ≤20°\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 23.85公斤\n" +
            "标准参数：\n" +
            "\n" +
            "太阳能电池板角度: 干刷 0～15°/水洗 0～10°\n" +
            "太阳能电池板表面温度: 干刷 -20～80℃/水洗 0～80℃\n" +
            "环境温度: 干刷 -20～50℃/水洗 0～50℃\n" +
            "太阳能电池板间距: 40mm\n" +
            "太阳能电池板高度差: 干刷 30mm/水洗 25mm\n" +
            "降雨量: 需要满足水洗倾角\n" +
            "风力: 干刷 62～74km/h 大风/水洗 25～38km/h 清劲风\n" +
            "防尘防水等级: IP65\n" +
            "寿命和耐用性：\n" +
            "\n" +
            "设计寿命: 6年\n" +
            "保修期: 1年或2400小时（以先到者为准）\n" +
            "电池容量: 15Ah\n" +
            "续航时间: 4小时\n" +
            "充电时间: 3小时\n" +
            "8小时续航方法: 每4小时更换一次电池\n" +
            "清洁能力：\n" +
            "\n" +
            "浮力: ≥99%\n" +
            "灰尘积累: ≥95%\n" +
            "干燥鸟粪清洁效率: ≥85%\n" +
            "清洁效率: ≥650\n" +
            "形状：\n" +
            "\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 23.85公斤\n" +
            "技术：\n" +
            "\n" +
            "操作系统: 基于TianyunOS 操作系统\n" +
            "视觉导航: 基于Glass vSLAM®视觉导航技术\n" +
            "路径规划: 基于Goodzenn®路径规划技术\n" +
            "AI平台: 基于AI-Kwun操作平台\n" +
            "OTA平台: 基于OTA-Kwun操作平台\n" +
            "操作：\n" +
            "\n" +
            "单人最大可控制数量: 24台\n" +
            "建议最大可控制数量（斜坡）: 4台\n" +
            "建议最大可控制数量（屋顶）: 4台\n" +
            "软件维护升级: OTA升级\n" +
            "夜间作业: 支持\n" +
            "实时日志查看: 支持\n" +
            "无人机部署: 支持\n" +
            "坡道上的无人操作: 支持\n" +
            "远程控制: 支持\n" +
            "附加RF遥控器: 支持\n" +
            "断电后继续作业: 支持\n" +
            "调整刷子速度: 支持\n" +
            "额定刷子速度: 160转/分钟\n" +
            "安全性：\n" +
            "\n" +
            "操作模式: 自主作业，手机APP管理\n" +
            "定位方法: AI视觉语义\n" +
            "定位精度: ≤10mm\n" +
            "转向方向: 高精度吸附转向机\n" +
            "防跌落: AI视觉语义+超声波\n" +
            "防滑: 专用履带+高精度纠偏算法\n" +
            "防盗定位终端: 无\n" +
            "防护等级: IP65\n" +
            "无缝安全认证: 必维隐裂认证",
    },
    {
        keywordsId:1,
        keywords:["Kwun-B63G","KwunB63G","B63G","63G","堒-B63G"],
        message:"\"Kwun-B63G\" 是一款高性能的清洁机器人，具有多项关键参数，如下：\n" +
            "\n" +
            "产品版本: 堒® B63G\n" +
            "介绍: 6系中角度 水洗\n" +
            "转动方法: 遥控\n" +
            "昵称: 效率之王，天降奇兵\n" +
            "价格: 520,178 元\n" +
            "主要能力：\n" +
            "\n" +
            "清洁效率: ≥1,200平方米/小时\n" +
            "续航时间: 3小时\n" +
            "充电时间: 3小时\n" +
            "水洗角度: ≤15°\n" +
            "干刷角度: ≤20°\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 23.85公斤\n" +
            "标准参数：\n" +
            "\n" +
            "太阳能电池板角度: 干刷 0～20°/水洗 0～15°\n" +
            "太阳能电池板表面温度: 干刷 -20～80℃/水洗 0～80℃\n" +
            "环境温度: 干刷 -20～50℃/水洗 0～50℃\n" +
            "太阳能电池板间距: 40mm\n" +
            "太阳能电池板高度差: 干刷 30mm/水洗 25mm\n" +
            "降雨量: 需要满足水洗倾角\n" +
            "风力: 干刷 62～74km/h 大风/水洗 25～38km/h 轻劲风\n" +
            "防尘防水等级: IP65\n" +
            "寿命和耐用性：\n" +
            "\n" +
            "设计寿命: 6年\n" +
            "保修期: 1年或2400小时（以先到者为准）\n" +
            "电池容量: 15Ah\n" +
            "续航时间: 4小时\n" +
            "充电时间: 3小时\n" +
            "8小时续航方法: 每4小时更换一次电池\n" +
            "清洁能力：\n" +
            "\n" +
            "浮力: ≥85%\n" +
            "灰尘积累: ≥80%\n" +
            "干燥鸟粪清洁效率: ≥70%\n" +
            "清洁效率: ≥1,200\n" +
            "形状：\n" +
            "\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 23.80公斤\n" +
            "技术：\n" +
            "\n" +
            "操作系统: 基于TianyunOS 操作系统\n" +
            "视觉导航: 基于Glass vSLAM®视觉导航技术\n" +
            "路径规划: 基于Goodzenn®路径规划技术\n" +
            "AI平台: 基于AI-Kwun操作平台\n" +
            "OTA平台: 基于OTA-Kwun操作平台\n" +
            "操作：\n" +
            "\n" +
            "单人最大可控制数量: 12台\n" +
            "建议最大可控制数量（斜坡）: 2台\n" +
            "建议最大可控制数量（屋顶）: 2台\n" +
            "软件维护升级: OTA升级\n" +
            "夜间作业: 否\n" +
            "实时日志查看: 支持\n" +
            "无人机部署: 否\n" +
            "坡道上的无人操作: 支持\n" +
            "远程控制: 支持\n" +
            "附加RF遥控器: 否\n" +
            "断电后继续作业: 否\n" +
            "调整刷子速度: 支持\n" +
            "额定刷子速度: 160转/分钟\n" +
            "安全性：\n" +
            "\n" +
            "操作模式: 自主作业，手机APP管理\n" +
            "定位方法: AI视觉语义\n" +
            "定位精度: ≤20mm\n" +
            "转向方向: 高精度吸附转向机\n" +
            "防跌落: AI视觉语义+超声波\n" +
            "防滑: 专用履带+高精度纠偏算法\n" +
            "防盗定位终端: 无\n" +
            "防护等级: IP65\n" +
            "无缝安全认证: 必维隐裂认证",
    },
    {
        keywordsId:1,
        keywords:["Kwun-B62G","KwunB62G","B62G","62G","堒-B62G"],
        message:"\"Kwun-B62G\" 是一款高性能的清洁机器人，具有多项关键参数，如下：\n" +
            "\n" +
            "产品版本: 堒® B62G\n" +
            "介绍: 6系中角度 水洗\n" +
            "转动方法: 遥控\n" +
            "昵称: 效率之王，天降奇兵\n" +
            "价格: 520,178 元\n" +
            "主要能力：\n" +
            "\n" +
            "清洁效率: ≥1,200平方米/小时\n" +
            "续航时间: 4.5小时\n" +
            "充电时间: 3小时\n" +
            "水洗角度: ≤15°\n" +
            "干刷角度: ≤10°\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 19.75公斤\n" +
            "标准参数：\n" +
            "\n" +
            "太阳能电池板角度: 干刷 0～15°/水洗 0～10°\n" +
            "太阳能电池板表面温度: 干刷 -20～80℃/水洗 0～80℃\n" +
            "环境温度: 干刷 -20～50℃/水洗 0～50℃\n" +
            "太阳能电池板间距: 40mm\n" +
            "太阳能电池板高度差: 干刷 40mm/水洗 20mm\n" +
            "降雨量: 需要满足水洗倾角\n" +
            "风力: 干刷 62～74km/h 大风/水洗 29～38km/h 清劲风\n" +
            "防尘防水等级: IP65\n" +
            "寿命和耐用性：\n" +
            "\n" +
            "设计寿命: 6年\n" +
            "保修期: 1年或2400小时（以先到者为准）\n" +
            "电池容量: 15Ah\n" +
            "续航时间: 4.5小时\n" +
            "充电时间: 3小时\n" +
            "8小时续航方法: 每4.5小时更换一次电池\n" +
            "清洁能力：\n" +
            "\n" +
            "浮力: ≥99%\n" +
            "灰尘积累: ≥95%\n" +
            "干燥鸟粪清洁效率: ≥85%\n" +
            "清洁效率: ≥1,200\n" +
            "形状：\n" +
            "\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 23.80公斤\n" +
            "技术：\n" +
            "\n" +
            "操作系统: 基于TianyunOS 操作系统\n" +
            "视觉导航: 基于Glass vSLAM®视觉导航技术\n" +
            "路径规划: 基于Goodzenn®路径规划技术\n" +
            "AI平台: 基于AI-Kwun操作平台\n" +
            "OTA平台: 基于OTA-Kwun操作平台\n" +
            "操作：\n" +
            "\n" +
            "单人最大可控制数量: 24台\n" +
            "建议最大可控制数量（斜坡）: 4台\n" +
            "建议最大可控制数量（屋顶）: 4台\n" +
            "软件维护升级: OTA升级\n" +
            "夜间作业: 支持\n" +
            "实时日志查看: 支持\n" +
            "无人机部署: 支持\n" +
            "坡道上的无人操作: 支持\n" +
            "远程控制: 支持\n" +
            "附加RF遥控器: 支持\n" +
            "断电后继续作业: 支持\n" +
            "调整刷子速度: 支持\n" +
            "额定刷子速度: 120转/分钟\n" +
            "安全性：\n" +
            "\n" +
            "操作模式: 自主作业，手机APP管理\n" +
            "定位方法: AI视觉语义\n" +
            "定位精度: ≤10mm\n" +
            "转向方向: 高精度吸附转向机\n" +
            "防跌落: AI视觉语义+超声波\n" +
            "防滑: 专用履带+高精度纠偏算法\n" +
            "防盗定位终端: 无\n" +
            "防护等级: IP65\n" +
            "无缝安全认证: 必维隐裂认证",
    },
    {
        keywordsId:1,
        keywords:["Kwun-B33F","KwunB33F","B33F","33F","堒-B33F"],
        message:"\"Kwun-B33F\" 是一款专为漂浮电站设计的清洁机器人，具有多项关键参数，如下：\n" +
            "\n" +
            "产品版本: 堒® B33F\n" +
            "介绍: 中角度大跨度\n" +
            "转动方法: 遥控\n" +
            "昵称: 海上之王，漂浮专清\n" +
            "价格: 520,178 元\n" +
            "主要能力：\n" +
            "\n" +
            "清洁效率: ≥600平方米/小时\n" +
            "续航时间: 4.5小时\n" +
            "充电时间: 3小时\n" +
            "水洗角度: ≤15°\n" +
            "干刷角度: ≤10°\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 19.70公斤\n" +
            "标准参数：\n" +
            "\n" +
            "太阳能电池板角度: 干刷 0～15°/水洗 0～10°\n" +
            "太阳能电池板表面温度: 干刷 -20～80℃/水洗 0～80℃\n" +
            "环境温度: 干刷 -20～50℃/水洗 0～50℃\n" +
            "太阳能电池板间距: 40mm\n" +
            "太阳能电池板高度差: 干刷 40mm/水洗 20mm\n" +
            "降雨量: 需要满足水洗倾角\n" +
            "风力: 干刷 62～74km/h 大风/水洗 29～38km/h 清劲风\n" +
            "防尘防水等级: IP65\n" +
            "寿命和耐用性：\n" +
            "\n" +
            "设计寿命: 6年\n" +
            "保修期: 1年或2400小时（以先到者为准）\n" +
            "电池容量: 15Ah\n" +
            "续航时间: 4.5小时\n" +
            "充电时间: 3小时\n" +
            "8小时续航方法: 每4.5小时更换一次电池\n" +
            "清洁能力：\n" +
            "\n" +
            "浮力: ≥85%\n" +
            "灰尘积累: ≥80%\n" +
            "干燥鸟粪清洁效率: ≥70%\n" +
            "清洁效率: ≥600\n" +
            "形状：\n" +
            "\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 19.70公斤\n" +
            "滚刷长度: D型 936mm\n" +
            "可拆卸滚刷重量: D型 5.7kg & 4.9kg\n" +
            "滚刷数量: 2个\n" +
            "技术：\n" +
            "\n" +
            "操作系统: 基于TianyunOS 操作系统\n" +
            "视觉导航: 基于Glass vSLAM®视觉导航技术\n" +
            "路径规划: 基于Goodzenn®路径规划技术\n" +
            "AI平台: 基于AI-Kwun操作平台\n" +
            "OTA平台: 基于OTA-Kwun操作平台\n" +
            "操作：\n" +
            "\n" +
            "单人最大可控制数量: 12台\n" +
            "建议最大可控制数量（斜坡）: 2台\n" +
            "建议最大可控制数量（屋顶）: 2台\n" +
            "软件维护升级: OTA升级\n" +
            "夜间作业: 否\n" +
            "实时日志查看: 支持\n" +
            "无人机部署: 否\n" +
            "坡道上的无人操作: 支持\n" +
            "远程控制: 支持\n" +
            "附加RF遥控器: 否\n" +
            "断电后继续作业: 否\n" +
            "调整刷子速度: 支持\n" +
            "额定刷子速度: 120转/分钟\n" +
            "安全性：\n" +
            "\n" +
            "操作模式: 自主作业，手机APP管理\n" +
            "定位方法: AI视觉语义\n" +
            "定位精度: ≤20mm\n" +
            "转向方向: 高精度吸附转向机\n" +
            "防跌落: AI视觉语义+超声波\n" +
            "防滑: 专用履带+高精度纠偏算法\n" +
            "防盗定位终端: 无\n" +
            "防护等级: IP65\n" +
            "无缝安全认证: 必维隐裂认证",
    },
    {
        keywordsId:1,
        keywords:["Kwun-B33H","KwunB33H","B33H","33H","堒-B33H"],
        message:"以下是产品 \"Kwun-B33H\" 的参数描述：\n" +
            "\n" +
            "产品版本: 堒® B33H\n" +
            "介绍: 3系中角度高端\n" +
            "转动方法: 自主\n" +
            "昵称: 通用之王，无尽分享\n" +
            "价格: 246,666 元\n" +
            "主要能力：\n" +
            "\n" +
            "清洁效率: ≥650平方米/小时\n" +
            "续航时间: 3小时\n" +
            "充电时间: 3小时\n" +
            "水洗角度: ≤15°\n" +
            "干刷角度: ≤20°\n" +
            "机身尺寸(不含滚刷): 650560250mm\n" +
            "机身重量(不含滚刷): 25.75公斤\n" +
            "标准参数：\n" +
            "\n" +
            "太阳能电池板角度: 干刷 0～20°/水洗 0～15°\n" +
            "太阳能电池板表面温度: 干刷 -20～80℃/水洗 0～80℃\n" +
            "环境温度: 干刷 -20～50℃/水洗 0～50℃\n" +
            "太阳能电池板间距: 40mm\n" +
            "太阳能电池板高度差: 干刷 30mm/水洗 25mm\n" +
            "降雨量: 需要满足水洗倾角\n" +
            "风力: 干刷 62～74km/h 大风/水洗 29～38km/h 清劲风\n" +
            "防尘防水等级: IP65\n" +
            "寿命和耐用性：\n" +
            "\n" +
            "设计寿命: 6年\n" +
            "保修期: 1年或2400小时（以先到者为准）\n" +
            "电池容量: 15Ah\n" +
            "续航时间: 3小时\n" +
            "充电时间: 3小时\n" +
            "8小时续航方法: 每3小时更换一次电池\n" +
            "清洁能力：\n" +
            "\n" +
            "浮力: ≥99%\n" +
            "灰尘积累: ≥95%\n" +
            "干燥鸟粪清洁效率: ≥85%\n" +
            "清洁效率: ≥650\n" +
            "形状：\n" +
            "\n" +
            "机身尺寸(不含滚刷): 650560250mm\n" +
            "机身重量(不含滚刷): 25.75公斤\n" +
            "技术：\n" +
            "\n" +
            "操作系统: 基于TianyunOS 操作系统\n" +
            "视觉导航: 基于Glass vSLAM®视觉导航技术\n" +
            "路径规划: 基于Goodzenn®路径规划技术\n" +
            "AI平台: 基于AI-Kwun操作平台\n" +
            "OTA平台: 基于OTA-Kwun操作平台\n" +
            "操作：\n" +
            "\n" +
            "单人最大可控制数量: 24台\n" +
            "建议最大可控制数量（斜坡）: 4台\n" +
            "建议最大可控制数量（屋顶）: 4台\n" +
            "软件维护升级: OTA升级\n" +
            "夜间作业: 能\n" +
            "实时日志查看: 能\n" +
            "无人机部署: 能\n" +
            "坡道上的无人操作: 能\n" +
            "远程控制: 能\n" +
            "附加RF遥控器: 能\n" +
            "断电后继续作业: 能\n" +
            "调整刷子速度: 能\n" +
            "额定刷子速度: 160转/分钟\n" +
            "安全性：\n" +
            "\n" +
            "操作模式: 自主作业，手机APP管理\n" +
            "定位方法: AI视觉语义\n" +
            "定位精度: ≤10mm\n" +
            "转向方向: 高精度吸附转向机\n" +
            "防跌落: AI视觉语义+超声波\n" +
            "防滑: 专用履带+高精度纠偏算法\n" +
            "防盗定位终端: ≤10m 中国境内\n" +
            "防护等级: IP65\n" +
            "无缝安全认证: 必维隐裂认证",
    },
    {
        keywordsId:1,
        keywords:["Kwun-B32H","KwunB32H","B32H","32H","堒-B32H"],
        message:"以下是产品 \"Kwun-B32H\" 的参数描述：\n" +
            "\n" +
            "产品版本: 堒® B32H\n" +
            "介绍: 3系小角度 标准\n" +
            "转动方法: 自主\n" +
            "昵称: 赚钱大侠，性价比典范\n" +
            "价格: 188,666 元\n" +
            "主要能力：\n" +
            "\n" +
            "清洁效率: ≥650平方米/小时\n" +
            "续航时间: 4小时\n" +
            "充电时间: 3小时\n" +
            "水洗角度: ≤10°\n" +
            "干刷角度: ≤15°\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 23.85公斤\n" +
            "标准参数：\n" +
            "\n" +
            "太阳能电池板角度: 干刷 0～15°/水洗 0～10°\n" +
            "太阳能电池板表面温度: 干刷 -20～80℃/水洗 0～80℃\n" +
            "环境温度: 干刷 -20～50℃/水洗 0～50℃\n" +
            "太阳能电池板间距: 40mm\n" +
            "太阳能电池板高度差: 干刷 30mm/水洗 25mm\n" +
            "降雨量: 需要满足水洗倾角\n" +
            "风力: 干刷 62～74km/h 大风/水洗 25～38km/h 清劲风\n" +
            "防尘防水等级: IP65\n" +
            "寿命和耐用性：\n" +
            "\n" +
            "设计寿命: 6年\n" +
            "保修期: 1年或2400小时（以先到者为准）\n" +
            "电池容量: 15Ah\n" +
            "续航时间: 4小时\n" +
            "充电时间: 3小时\n" +
            "8小时续航方法: 每4小时更换一次电池\n" +
            "清洁能力：\n" +
            "\n" +
            "浮力: ≥99%\n" +
            "灰尘积累: ≥95%\n" +
            "干燥鸟粪清洁效率: ≥85%\n" +
            "清洁效率: ≥650\n" +
            "形状：\n" +
            "\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 23.85公斤\n" +
            "技术：\n" +
            "\n" +
            "操作系统: 基于TianyunOS 操作系统\n" +
            "视觉导航: 基于Glass vSLAM®视觉导航技术\n" +
            "路径规划: 基于Goodzenn®路径规划技术\n" +
            "AI平台: 基于AI-Kwun操作平台\n" +
            "OTA平台: 基于OTA-Kwun操作平台\n" +
            "操作：\n" +
            "\n" +
            "单人最大可控制数量: 24台\n" +
            "建议最大可控制数量（斜坡）: 4台\n" +
            "建议最大可控制数量（屋顶）: 4台\n" +
            "软件维护升级: OTA升级\n" +
            "夜间作业: 能\n" +
            "实时日志查看: 能\n" +
            "无人机部署: 能\n" +
            "坡道上的无人操作: 能\n" +
            "远程控制: 能\n" +
            "附加RF遥控器: 能\n" +
            "断电后继续作业: 能\n" +
            "调整刷子速度: 能\n" +
            "额定刷子速度: 160转/分钟\n" +
            "安全性：\n" +
            "\n" +
            "操作模式: 自主作业，手机APP管理\n" +
            "定位方法: AI视觉语义\n" +
            "定位精度: ≤10mm\n" +
            "转向方向: 高精度吸附转向机\n" +
            "防跌落: AI视觉语义+超声波\n" +
            "防滑: 专用履带+高精度纠偏算法\n" +
            "防盗定位终端: 无\n" +
            "防护等级: IP65\n" +
            "无缝安全认证: 必维隐裂认证",
    },
    {
        keywordsId:1,
        keywords:["Kwun-B32L","KwunB32L","B32L","32L","堒-B32L"],
        message:"以下是产品 \"Kwun-B32L\" 的参数描述：\n" +
            "\n" +
            "产品版本: 堒® B32L\n" +
            "介绍: 3系小角度 标准\n" +
            "转动方法: 自主\n" +
            "昵称: 赚钱之王，性价比典范\n" +
            "价格: 156,666 元\n" +
            "主要能力：\n" +
            "\n" +
            "清洁效率: ≥600平方米/小时\n" +
            "续航时间: 4小时\n" +
            "充电时间: 3小时\n" +
            "水洗角度: ≤10°\n" +
            "干刷角度: ≤15°\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 23.80公斤\n" +
            "标准参数：\n" +
            "\n" +
            "太阳能电池板角度: 干刷 0～15°/水洗 0～10°\n" +
            "太阳能电池板表面温度: 干刷 -20～80℃/水洗 0～80℃\n" +
            "环境温度: 干刷 -20～50℃/水洗 0～50℃\n" +
            "太阳能电池板间距: 40mm\n" +
            "太阳能电池板高度差: 干刷 30mm/水洗 25mm\n" +
            "降雨量: 需要满足水洗倾角\n" +
            "风力: 干刷 62～74km/h 大风/水洗 29～38km/h 轻劲风\n" +
            "防尘防水等级: IP65\n" +
            "寿命和耐用性：\n" +
            "\n" +
            "设计寿命: 6年\n" +
            "保修期: 1年或2400小时（以先到者为准）\n" +
            "电池容量: 15Ah\n" +
            "续航时间: 4小时\n" +
            "充电时间: 3小时\n" +
            "8小时续航方法: 每4小时更换一次电池\n" +
            "清洁能力：\n" +
            "\n" +
            "浮力: ≥85%\n" +
            "灰尘积累: ≥80%\n" +
            "干燥鸟粪清洁效率: ≥70%\n" +
            "清洁效率: ≥600\n" +
            "形状：\n" +
            "\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 23.80公斤\n" +
            "技术：\n" +
            "\n" +
            "操作系统: 基于TianyunOS 操作系统\n" +
            "视觉导航: 基于Glass vSLAM®视觉导航技术\n" +
            "路径规划: 基于Goodzenn®路径规划技术\n" +
            "AI平台: 基于AI-Kwun操作平台\n" +
            "OTA平台: 基于OTA-Kwun操作平台\n" +
            "操作：\n" +
            "\n" +
            "单人最大可控制数量: 12台\n" +
            "建议最大可控制数量（斜坡）: 2台\n" +
            "建议最大可控制数量（屋顶）: 2台\n" +
            "软件维护升级: OTA升级\n" +
            "夜间作业: 否\n" +
            "实时日志查看: 能\n" +
            "无人机部署: 否\n" +
            "坡道上的无人操作: 能\n" +
            "远程控制: 能\n" +
            "附加RF遥控器: 否\n" +
            "断电后继续作业: 否\n" +
            "调整刷子速度: 能\n" +
            "额定刷子速度: 160转/分钟\n" +
            "安全性：\n" +
            "\n" +
            "操作模式: 自主作业，手机APP管理\n" +
            "定位方法: AI视觉语义\n" +
            "定位精度: ≤20mm\n" +
            "转向方向: 高精度吸附转向机\n" +
            "防跌落: AI视觉语义+超声波\n" +
            "防滑: 专用履带+高精度纠偏算法\n" +
            "防盗定位终端: 无\n" +
            "防护等级: IP65\n" +
            "无缝安全认证: 必维隐裂认证",
    },
    {
        keywordsId:1,
        keywords:["Kwun-B22H","KwunB22H","B22H","22H","堒-B22H"],
        message:"以下是产品 \"Kwun-B22H\" 的参数描述：\n" +
            "\n" +
            "产品版本: 堒® B22H\n" +
            "介绍: 2系小角度 标准\n" +
            "转动方法: 自主\n" +
            "昵称: 发电神侠，电企必备\n" +
            "价格: 132,666 元\n" +
            "主要能力：\n" +
            "\n" +
            "清洁效率: ≥450平方米/小时\n" +
            "续航时间: 4.5小时\n" +
            "充电时间: 3小时\n" +
            "水洗角度: ≤10°\n" +
            "干刷角度: ≤15°\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 19.75公斤\n" +
            "标准参数：\n" +
            "\n" +
            "太阳能电池板角度: 干刷 0～15°/水洗 0～10°\n" +
            "太阳能电池板表面温度: 干刷 -20～80℃/水洗 0～80℃\n" +
            "环境温度: 干刷 -20～50℃/水洗 0～50℃\n" +
            "太阳能电池板间距: 40mm\n" +
            "太阳能电池板高度差: 干刷 40mm/水洗 20mm\n" +
            "降雨量: 需要满足水洗倾角\n" +
            "风力: 干刷 62～74km/h 大风/水洗 29～38km/h 清劲风\n" +
            "防尘防水等级: IP65\n" +
            "寿命和耐用性：\n" +
            "\n" +
            "设计寿命: 6年\n" +
            "保修期: 1年或2400小时（以先到者为准）\n" +
            "电池容量: 15Ah\n" +
            "续航时间: 4.5小时\n" +
            "充电时间: 3小时\n" +
            "8小时续航方法: 每4.5小时更换一次电池\n" +
            "清洁能力：\n" +
            "\n" +
            "浮力: ≥99%\n" +
            "灰尘积累: ≥95%\n" +
            "干燥鸟粪清洁效率: ≥85%\n" +
            "清洁效率: ≥450\n" +
            "形状：\n" +
            "\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 19.75公斤\n" +
            "滚刷长度: D型 936mm\n" +
            "可拆卸滚刷重量: D型 5.7kg & 4.9kg\n" +
            "滚刷数量: 2个\n" +
            "技术：\n" +
            "\n" +
            "操作系统: 基于TianyunOS 操作系统\n" +
            "视觉导航: 基于Glass vSLAM®视觉导航技术\n" +
            "路径规划: 基于Goodzenn®路径规划技术\n" +
            "AI平台: 基于AI-Kwun操作平台\n" +
            "OTA平台: 基于OTA-Kwun操作平台\n" +
            "操作：\n" +
            "\n" +
            "单人最大可控制数量: 24台\n" +
            "建议最大可控制数量（斜坡）: 4台\n" +
            "建议最大可控制数量（屋顶）: 4台\n" +
            "软件维护升级: OTA升级\n" +
            "夜间作业: 支持\n" +
            "实时日志查看: 支持\n" +
            "无人机部署: 支持\n" +
            "坡道上的无人操作: 支持\n" +
            "远程控制: 支持\n" +
            "附加RF遥控器: 支持\n" +
            "断电后继续作业: 支持\n" +
            "调整刷子速度: 支持\n" +
            "额定刷子速度: 120转/分钟\n" +
            "安全性：\n" +
            "\n" +
            "操作模式: 自主作业，手机APP管理\n" +
            "定位方法: AI视觉语义\n" +
            "定位精度: ≤10mm\n" +
            "转向方向: 高精度吸附转向机\n" +
            "防跌落: AI视觉语义+超声波\n" +
            "防滑: 专用履带+高精度纠偏算法\n" +
            "防盗定位终端: 无\n" +
            "防护等级: IP65\n" +
            "无缝安全认证: 必维隐裂认证",
    },
    {
        keywordsId:1,
        keywords:["Kwun-B22L","KwunB22L","B22L","22L","堒-B22L"],
        message:"以下是产品 \"Kwun-B22L\" 的参数描述：\n" +
            "\n" +
            "产品版本: 堒® B22L\n" +
            "介绍: 2系小角度 标准\n" +
            "转动方法: 自主\n" +
            "昵称: 发电之王，电企必备\n" +
            "价格: 116,666 元\n" +
            "主要能力：\n" +
            "\n" +
            "清洁效率: ≥400平方米/小时\n" +
            "续航时间: 4.5小时\n" +
            "充电时间: 3小时\n" +
            "水洗角度: ≤10°\n" +
            "干刷角度: ≤15°\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 19.70公斤\n" +
            "标准参数：\n" +
            "\n" +
            "太阳能电池板角度: 干刷 0～15°/水洗 0～10°\n" +
            "太阳能电池板表面温度: 干刷 -20～80℃/水洗 0～80℃\n" +
            "环境温度: 干刷 -20～50℃/水洗 0～50℃\n" +
            "太阳能电池板间距: 40mm\n" +
            "太阳能电池板高度差: 干刷 40mm/水洗 20mm\n" +
            "降雨量: 需要满足水洗倾角\n" +
            "风力: 干刷 62～74km/h 大风/水洗 29～38km/h 清劲风\n" +
            "防尘防水等级: IP65\n" +
            "寿命和耐用性：\n" +
            "\n" +
            "设计寿命: 6年\n" +
            "保修期: 1年或2400小时（以先到者为准）\n" +
            "电池容量: 15Ah\n" +
            "续航时间: 4.5小时\n" +
            "充电时间: 3小时\n" +
            "8小时续航方法: 每4.5小时更换一次电池\n" +
            "清洁能力：\n" +
            "\n" +
            "浮力: ≥85%\n" +
            "灰尘积累: ≥80%\n" +
            "干燥鸟粪清洁效率: ≥70%\n" +
            "清洁效率: ≥400\n" +
            "形状：\n" +
            "\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 19.70公斤\n" +
            "滚刷长度: D型 936mm\n" +
            "可拆卸滚刷重量: D型 5.7kg & 4.9kg\n" +
            "滚刷数量: 2个\n" +
            "技术：\n" +
            "\n" +
            "操作系统: 基于TianyunOS 操作系统\n" +
            "视觉导航: 基于Glass vSLAM®视觉导航技术\n" +
            "路径规划: 基于Goodzenn®路径规划技术\n" +
            "AI平台: 基于AI-Kwun操作平台\n" +
            "OTA平台: 基于OTA-Kwun操作平台\n" +
            "操作：\n" +
            "\n" +
            "单人最大可控制数量: 12台\n" +
            "建议最大可控制数量（斜坡）: 2台\n" +
            "建议最大可控制数量（屋顶）: 2台\n" +
            "软件维护升级: OTA升级\n" +
            "夜间作业: 否\n" +
            "实时日志查看: 支持\n" +
            "无人机部署: 否\n" +
            "坡道上的无人操作: 支持\n" +
            "远程控制: 支持\n" +
            "附加RF遥控器: 否\n" +
            "断电后继续作业: 否\n" +
            "调整刷子速度: 支持\n" +
            "额定刷子速度: 120转/分钟\n" +
            "安全性：\n" +
            "\n" +
            "操作模式: 自主作业，手机APP管理\n" +
            "定位方法: AI视觉语义\n" +
            "定位精度: ≤20mm\n" +
            "转向方向: 高精度吸附转向机\n" +
            "防跌落: AI视觉语义+超声波\n" +
            "防滑: 专用履带+高精度纠偏算法\n" +
            "防盗定位终端: 无\n" +
            "防护等级: IP65\n" +
            "无缝安全认证: 必维隐裂认证",
    },
    {
        keywordsId:1,
        keywords:["Kwun-B11L","KwunB11L","B11L","11L","堒-B11L"],
        message:"以下是产品 \"Kwun-B11L\" 的参数描述：\n" +
            "\n" +
            "产品版本: 堒® B11L\n" +
            "介绍: 1系小角度 标准\n" +
            "转动方法: 自主\n" +
            "昵称: 户用王者，万家乐选\n" +
            "价格: 106,666 元\n" +
            "主要能力：\n" +
            "\n" +
            "清洁效率: ≥200平方米/小时\n" +
            "续航时间: 5小时\n" +
            "充电时间: 3小时\n" +
            "水洗角度: ≤5°\n" +
            "干刷角度: ≤10°\n" +
            "机身尺寸(不含滚刷): 550390230mm\n" +
            "机身重量(不含滚刷): 14.15公斤\n" +
            "标准参数：\n" +
            "\n" +
            "太阳能电池板角度: 干刷 0～10°/水洗 0～5°\n" +
            "太阳能电池板表面温度: 干刷 -20～80℃/水洗 0～80℃\n" +
            "环境温度: 干刷 -20～50℃/水洗 0～50℃\n" +
            "太阳能电池板间距: 40mm\n" +
            "太阳能电池板高度差: 干刷 30mm/水洗 25mm\n" +
            "降雨量: 需要满足水洗倾角\n" +
            "风力: 干刷 39～49km/h 强风/水洗 20～28km/h 和风\n" +
            "防尘防水等级: IP65\n" +
            "寿命和耐用性：\n" +
            "\n" +
            "设计寿命: 6年\n" +
            "保修期: 1年或2400小时（以先到者为准）\n" +
            "电池容量: 15Ah\n" +
            "续航时间: 5小时\n" +
            "充电时间: 3小时\n" +
            "8小时续航方法: 每5小时更换一次电池\n" +
            "清洁能力：\n" +
            "\n" +
            "浮力: ≥85%\n" +
            "灰尘积累: ≥80%\n" +
            "干燥鸟粪清洁效率: ≥70%\n" +
            "清洁效率: ≥200\n" +
            "形状：\n" +
            "\n" +
            "机身尺寸(不含滚刷): 550390230mm\n" +
            "机身重量(不含滚刷): 14.15公斤\n" +
            "滚刷长度: 641180130mm\n" +
            "可拆卸滚刷重量: F型 3kg & 2.5kg\n" +
            "滚刷数量: 2个\n" +
            "技术：\n" +
            "\n" +
            "操作系统: 基于TianyunOS 操作系统\n" +
            "视觉导航: 基于Glass vSLAM®视觉导航技术\n" +
            "路径规划: 基于Goodzenn®路径规划技术\n" +
            "AI平台: 基于AI-Kwun操作平台\n" +
            "OTA平台: 基于OTA-Kwun操作平台\n" +
            "操作：\n" +
            "\n" +
            "单人最大可控制数量: 12台\n" +
            "建议最大可控制数量（斜坡）: 2台\n" +
            "建议最大可控制数量（屋顶）: 2台\n" +
            "软件维护升级: OTA升级\n" +
            "夜间作业: 否\n" +
            "实时日志查看: 支持\n" +
            "无人机部署: 否\n" +
            "坡道上的无人操作: 支持\n" +
            "远程控制: 支持\n" +
            "附加RF遥控器: 否\n" +
            "断电后继续作业: 否\n" +
            "调整刷子速度: 支持\n" +
            "额定刷子速度: 180转/分钟\n" +
            "安全性：\n" +
            "\n" +
            "操作模式: 自主作业，手机APP管理\n" +
            "定位方法: AI视觉语义\n" +
            "定位精度: ≤20mm\n" +
            "转向方向: 高精度吸附转向机\n" +
            "防跌落: AI视觉语义+超声波\n" +
            "防滑: 专用履带+高精度纠偏算法\n" +
            "防盗定位终端: 无\n" +
            "防护等级: IP65\n" +
            "无缝安全认证: 必维隐裂认证",
    },
    {
        keywordsId:1,
        keywords:["Kwun-B11T","KwunB11T","B11T","11T","堒-B11T"],
        message:"以下是产品 \"Kwun-B11T\" 的参数描述：\n" +
            "\n" +
            "产品版本: 堒®-B11T\n" +
            "介绍: 1系小角度 标准\n" +
            "转动方法: 自主\n" +
            "昵称: 户用王者，万家乐选\n" +
            "价格: 106,666 元\n" +
            "主要能力：\n" +
            "\n" +
            "清洁效率: ≥450平方米/小时\n" +
            "续航时间: 4.5小时\n" +
            "充电时间: 3小时\n" +
            "水洗角度: ≤15°\n" +
            "干刷角度: ≤10°\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 19.75公斤\n" +
            "标准参数：\n" +
            "\n" +
            "太阳能电池板角度: 干刷 0～15°/水洗 0～10°\n" +
            "太阳能电池板表面温度: 干刷 -20～80℃/水洗 0～80℃\n" +
            "环境温度: 干刷 -20～50℃/水洗 0～50℃\n" +
            "太阳能电池板间距: 40mm\n" +
            "太阳能电池板高度差: 干刷 40mm/水洗 20mm\n" +
            "降雨量: 需要满足水洗倾角\n" +
            "风力: 干刷 62～74km/h 大风/水洗 29～38km/h 清劲风\n" +
            "防尘防水等级: IP65\n" +
            "寿命和耐用性：\n" +
            "\n" +
            "设计寿命: 6年\n" +
            "保修期: 1年或2400小时（以先到者为准）\n" +
            "电池容量: 15Ah\n" +
            "续航时间: 4.5小时\n" +
            "充电时间: 3小时\n" +
            "8小时续航方法: 每4.5小时更换一次电池\n" +
            "清洁能力：\n" +
            "\n" +
            "浮力: ≥99%\n" +
            "灰尘积累: ≥95%\n" +
            "干燥鸟粪清洁效率: ≥85%\n" +
            "清洁效率: ≥450\n" +
            "形状：\n" +
            "\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 19.75公斤\n" +
            "滚刷长度: D型 585560250mm\n" +
            "可拆卸滚刷重量: D型 5.7kg & 4.9kg\n" +
            "滚刷数量: 2个\n" +
            "技术：\n" +
            "\n" +
            "操作系统: 基于TianyunOS 操作系统\n" +
            "视觉导航: 基于Glass vSLAM®视觉导航技术\n" +
            "路径规划: 基于Goodzenn®路径规划技术\n" +
            "AI平台: 基于AI-Kwun操作平台\n" +
            "OTA平台: 基于OTA-Kwun操作平台\n" +
            "操作：\n" +
            "\n" +
            "单人最大可控制数量: 24台\n" +
            "建议最大可控制数量（斜坡）: 4台\n" +
            "建议最大可控制数量（屋顶）: 4台\n" +
            "软件维护升级: OTA升级\n" +
            "夜间作业: 支持\n" +
            "实时日志查看: 支持\n" +
            "无人机部署: 支持\n" +
            "坡道上的无人操作: 支持\n" +
            "远程控制: 支持\n" +
            "附加RF遥控器: 支持\n" +
            "断电后继续作业: 支持\n" +
            "调整刷子速度: 支持\n" +
            "额定刷子速度: 120转/分钟\n" +
            "安全性：\n" +
            "\n" +
            "操作模式: 自主作业，手机APP管理\n" +
            "定位方法: AI视觉语义\n" +
            "定位精度: ≤10mm\n" +
            "转向方向: 高精度吸附转向机\n" +
            "防跌落: AI视觉语义+超声波\n" +
            "防滑: 专用履带+高精度纠偏算法\n" +
            "防盗定位终端: 无\n" +
            "防护等级: IP65\n" +
            "无缝安全认证: 必维隐裂认证",
    },
    {
        keywordsId:1,
        keywords:["Kwun-B12T","KwunB12T","B12T","12T","堒-B12T"],
        message:"以下是产品 \"Kwun-B12T\" 的参数描述：\n" +
            "\n" +
            "产品版本: 堒®-B12T\n" +
            "介绍: 1系小角度 标准\n" +
            "转动方法: 自主\n" +
            "昵称: 户用信使，轻盈天使\n" +
            "价格: 106,666 元\n" +
            "主要能力：\n" +
            "\n" +
            "清洁效率: ≥400平方米/小时\n" +
            "续航时间: 4.5小时\n" +
            "充电时间: 3小时\n" +
            "水洗角度: ≤15°\n" +
            "干刷角度: ≤10°\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 19.70公斤\n" +
            "标准参数：\n" +
            "\n" +
            "太阳能电池板角度: 干刷 0～15°/水洗 0～10°\n" +
            "太阳能电池板表面温度: 干刷 -20～80℃/水洗 0～80℃\n" +
            "环境温度: 干刷 -20～50℃/水洗 0～50℃\n" +
            "太阳能电池板间距: 40mm\n" +
            "太阳能电池板高度差: 干刷 40mm/水洗 20mm\n" +
            "降雨量: 需要满足水洗倾角\n" +
            "风力: 干刷 62～74km/h 大风/水洗 29～38km/h 清劲风\n" +
            "防尘防水等级: IP65\n" +
            "寿命和耐用性：\n" +
            "\n" +
            "设计寿命: 6年\n" +
            "保修期: 1年或2400小时（以先到者为准）\n" +
            "电池容量: 15Ah\n" +
            "续航时间: 4.5小时\n" +
            "充电时间: 3小时\n" +
            "8小时续航方法: 每4.5小时更换一次电池\n" +
            "清洁能力：\n" +
            "\n" +
            "浮力: ≥85%\n" +
            "灰尘积累: ≥80%\n" +
            "干燥鸟粪清洁效率: ≥70%\n" +
            "清洁效率: ≥400\n" +
            "形状：\n" +
            "\n" +
            "机身尺寸(不含滚刷): 585560250mm\n" +
            "机身重量(不含滚刷): 19.70公斤\n" +
            "滚刷长度: D型 936mm\n" +
            "可拆卸滚刷重量: D型 5.7kg & 4.9kg\n" +
            "滚刷数量: 2个\n" +
            "技术：\n" +
            "\n" +
            "操作系统: 基于TianyunOS 操作系统\n" +
            "视觉导航: 基于Glass vSLAM®视觉导航技术\n" +
            "路径规划: 基于Goodzenn®路径规划技术\n" +
            "AI平台: 基于AI-Kwun操作平台\n" +
            "OTA平台: 基于OTA-Kwun操作平台\n" +
            "操作：\n" +
            "\n" +
            "单人最大可控制数量: 12台\n" +
            "建议最大可控制数量（斜坡）: 2台\n" +
            "建议最大可控制数量（屋顶）: 2台\n" +
            "软件维护升级: OTA升级\n" +
            "夜间作业: 否\n" +
            "实时日志查看: 能\n" +
            "无人机部署: 否\n" +
            "坡道上的无人操作: 能\n" +
            "远程控制: 能\n" +
            "附加RF遥控器: 否\n" +
            "断电后继续作业: 否\n" +
            "调整刷子速度: 能\n" +
            "额定刷子速度: 120转/分钟\n" +
            "安全性：\n" +
            "\n" +
            "操作模式: 自主作业，手机APP管理\n" +
            "定位方法: AI视觉语义\n" +
            "定位精度: ≤20mm\n" +
            "转向方向: 高精度吸附转向机\n" +
            "防跌落: AI视觉语义+超声波\n" +
            "防滑: 专用履带+高精度纠偏算法\n" +
            "防盗定位终端: 无\n" +
            "防护等级: IP65\n" +
            "无缝安全认证: 必维隐裂认证",
    },
    {
        keywordsId:1,
        keywords:["Kwun-π1","Kwunπ1","π1","堒-π1"],
        message:"以下是产品 \"Kwun-π1\" 的参数描述：\n" +
            "\n" +
            "产品版本: 堒®-π1\n" +
            "介绍: 小角度下沿边框专洗\n" +
            "转动方法: 自主\n" +
            "昵称: 清洁怪才，腾云驾雾\n" +
            "价格: 106,666 元\n" +
            "主要能力：\n" +
            "\n" +
            "清洁效率: ≥200平方米/小时\n" +
            "续航时间: 5小时\n" +
            "充电时间: 3小时\n" +
            "水洗角度: ≤5°\n" +
            "干刷角度: ≤10°\n" +
            "机身尺寸(不含滚刷): 550390230mm\n" +
            "机身重量(不含滚刷): 14.15公斤\n" +
            "标准参数：\n" +
            "\n" +
            "太阳能电池板角度: 干刷 0～10°/水洗 0～5°\n" +
            "太阳能电池板表面温度: 干刷 -20～80℃/水洗 0～80℃\n" +
            "环境温度: 干刷 -20～50℃/水洗 0～50℃\n" +
            "太阳能电池板间距: 40mm\n" +
            "太阳能电池板高度差: 干刷 30mm/水洗 25mm\n" +
            "降雨量: 需要满足水洗倾角\n" +
            "风力: 干刷 39～49km/h 强风/水洗 20～28km/h 和风\n" +
            "防尘防水等级: IP65\n" +
            "寿命和耐用性：\n" +
            "\n" +
            "设计寿命: 6年\n" +
            "保修期: 1年或2400小时（以先到者为准）\n" +
            "电池容量: 15Ah\n" +
            "续航时间: 5小时\n" +
            "充电时间: 3小时\n" +
            "8小时续航方法: 每5小时更换一次电池\n" +
            "清洁能力：\n" +
            "\n" +
            "浮力: ≥85%\n" +
            "灰尘积累: ≥80%\n" +
            "干燥鸟粪清洁效率: ≥70%\n" +
            "清洁效率: ≥200\n" +
            "形状：\n" +
            "\n" +
            "机身尺寸(不含滚刷): 550390230mm\n" +
            "机身重量(不含滚刷): 14.15公斤\n" +
            "滚刷长度: 641180130mm\n" +
            "可拆卸滚刷重量: F型 3kg & 2.5kg\n" +
            "滚刷数量: 2个\n" +
            "技术：\n" +
            "\n" +
            "操作系统: 基于TianyunOS 操作系统\n" +
            "视觉导航: 基于Glass vSLAM®视觉导航技术\n" +
            "路径规划: 基于Goodzenn®路径规划技术\n" +
            "AI平台: 基于AI-Kwun操作平台\n" +
            "OTA平台: 基于OTA-Kwun操作平台\n" +
            "操作：\n" +
            "\n" +
            "单人最大可控制数量: 12台\n" +
            "建议最大可控制数量（斜坡）: 2台\n" +
            "建议最大可控制数量（屋顶）: 2台\n" +
            "软件维护升级: OTA升级\n" +
            "夜间作业: 否\n" +
            "实时日志查看: 能\n" +
            "无人机部署: 否\n" +
            "坡道上的无人操作: 能\n" +
            "远程控制: 能\n" +
            "附加RF遥控器: 否\n" +
            "断电后继续作业: 否\n" +
            "调整刷子速度: 能\n" +
            "额定刷子速度: 180转/分钟\n" +
            "安全性：\n" +
            "\n" +
            "操作模式: 自主作业，手机APP管理\n" +
            "定位方法: AI视觉语义\n" +
            "定位精度: ≤20mm\n" +
            "转向方向: 高精度吸附转向机\n" +
            "防跌落: AI视觉语义+超声波\n" +
            "防滑: 专用履带+高精度纠偏算法\n" +
            "防盗定位终端: 无\n" +
            "防护等级: IP65\n" +
            "无缝安全认证: 必维隐裂认证",
    },
    {
        keywordsId:1,
        keywords:["资讯电话","咨询电话","联系电话"],
        message:"4008786861",
    },
    {
        keywordsId:1,
        keywords:["好的"],
        message:"作为Kwunphi怪虫机器人公司的智能客服，我会尽力为客户提供优质的服务和支持。如果您有任何关于公司产品的问题或需要帮助，请随时告诉我。",
    },
    {
        keywordsId:1,
        keywords:["堒"],
        message:"堒 是怪虫机器人的产品名称！请问还有什么可以帮你吗？",
    },
    {
        keywordsId:1,
        keywords:["为什么叫堒"],
        message:"堒 是怪虫机器人的产品名称！请问还有什么可以帮你吗？",
    },
    {
        keywordsId:1,
        keywords:["Kwun","kwun"],
        message:"Kwun is the product name of the strange insect robot! Is there anything else I can help you with?",
    },
    {
        keywordsId:1,
        keywords:["客服微信"],
        message:"![](https://file.kwunphi.com/kwunphi4/images/qrcode/service.jpg)",
    },
    {
        keywordsId:1,
        keywords:["智障","傻逼","废物","你是个大聪明"],
        message:"我听不懂你在说什么。",
    },
    {
        keywordsId:1,
        keywords: ["你是谁开发的","开发你的工程师是谁"],
        message:"我是怪虫机器人的工程师开发的",
    },
    {
        keywordsId:1,
        keywords: ["你是谁开发的","开发你的工程师是谁"],
        message:"我是怪虫机器人的工程师开发的。",
    },
    {
        keywordsId:1,
        keywords: ["你的技术","如何开发你"],
        message:"我是怪虫机器人的工程师开发的智能客服，基于OpenAi公司的ChatGPT。",
    },
    {
        keywordsId:1,
        keywords: ["你好","您好","你好啊","您好啊","您"],
        message:"您好，请问有什么可以帮您。",
    },
    {
        keywordsId:1,
        keywords: ["怪虫机器人详情","怪虫机器人公司","怪虫机器公司","怪虫机器人"],
        message:"深圳怪虫机器人有限公司，成立于2018，是由机器视觉与自动驾驶专家团队创建的国家高新技术企业。\n" +
            "\n" +
            "\n" +
            "怪虫首个商业化产品——堒®，是世界首款基于视觉定位的光伏组件自主清洁机器人，自问世以来，以其安全、多场景、经济、智能、便利、清洁效果好、提升电量显著而著称，被誉为未来光伏清洁的先行者。现已在40多个国家获得广泛赞誉。\n" +
            "\n" +
            "\n" +
            "怪虫是光伏清洁质量的“倡导者”，是为光伏清洁而生设备堒®的“发明者”，是“可持续光伏清洁”这把财富钥匙的“发现者”。\n" +
            "\n" +
            "\n" +
            "怪虫每三个员工就有一个机器视觉或自动驾驶工程师。从最初的幕墙移动控制技术，从最初的幕墙移动控制技术，到光伏应用自主机器人、堒洁®团队专业管理系统，再到行业应用……怪虫工程师不忘初心收获一个个划时代产品，展现了大无畏的“怪虫拼搏”气概。",
    },
    {
        keywordsId:1,
        keywords:["陈应洪","公司老板","怪虫机器人公司老板是谁","你老板是谁","你知道陈应洪是谁吗","怪虫机器人的创始人是谁"],
        message:"怪虫机器人的创始人是陈应洪先生，是一位充满创造力和奋斗精神的企业家，他致力于推动清洁能源技术的创新发展。",
    },
    {
        keywordsId:1,
        keywords: ["你是谁","你叫什么名字","你的名字叫什么","你的名字"],
        message:"我叫堒宝宝，英文名字是KwunBaby，我是怪虫机器人公司开发的智能对话客服，用于提升用户使用体验和解决一些常见问题。如果您有任何问题，可以随时向我提问。",
    },
    {
        keywordsId:1,
        keywords:["牛逼啊","牛逼","太强了","太棒了","你很牛逼啊","你很牛逼","可以的"],
        message:"谢谢夸奖！作为Kwunphi怪虫机器人公司的智能客服，我会尽力为客户提供优质的服务和支持。如果您有任何关于公司产品的问题或需要帮助，请随时告诉我。",
    },
    {
        keywordsId:1,
        keywords:["你是chatGPT几","你是chatGPT4吗？","你是chatGPT4吗","你是chatGPT4？","你是chatGPT几代？","你是GPT几","你是gpt几"],
        message:"我是基于Openai的chatGPT-4模型！请问有什么可以帮你的吗？",
    },
    {
        keywordsId:1,
        keywords: ["你会唱跳rap篮球吗","你会唱跳rap吗?","唱跳rap","你会唱跳rap吗"],
        message:"您好，我是练习时长两年半的智能客服，我会唱跳rap篮球music，哎呀~~~你干嘛~~~",
    },
    {
        keywordsId:1,
        keywords: ["你知道蔡徐坤吗？","你知道蔡徐坤吗","你知道蔡徐坤","知道蔡徐坤",
            "蔡徐坤你知道吗？","蔡徐坤是谁","你了解蔡徐坤吗？"],
        message:"您好，我知道，但我不说，因为会被律师函警告。谢谢你的理解和支持。",
    },
    {
        keywordsId:1,
        keywords: ["你能做什么","你有什么本领","你的职责","客服的职责","本领","你的本领"],
        message:"我是怪虫机器人公司开发的智能对话客服，以下是我的一些常见任务和职责：\n" +
            "\n" +
            "客户问题解答： 回答客户的问题、疑虑和查询，提供信息和帮助。\n" +
            "\n" +
            "订单处理： 协助客户完成订单，解决订单相关的问题，如退款、取消订单等。\n" +
            "\n" +
            "投诉处理： 处理客户投诉，寻找解决方案以满足客户的需求，提高客户满意度。\n" +
            "\n" +
            "产品和服务推荐： 根据客户的需求和偏好，向客户推荐合适的产品或服务。\n" +
            "\n" +
            "故障排除： 协助客户解决技术或服务故障，提供技术支持。\n" +
            "\n" +
            "在线聊天支持： 通过在线聊天、电子邮件或社交媒体等渠道与客户沟通，提供实时支持。\n" +
            "\n" +
            "客户满意度调查： 收集客户反馈，进行满意度调查，了解客户体验并提出改进建议。\n" +
            "\n" +
            "记录和报告： 记录客户的问题和解决方案，生成报告以进行分析和监测客户支持绩效。\n" +
            "\n" +
            "培训和知识分享： 不断学习和更新产品知识，与团队分享最新信息，确保提供一致的支持。\n" +
            "\n" +
            "建立客户关系： 与客户建立积极的关系，提供友好、专业的服务，以促进客户保留和忠诚度。\n" +
            "\n" +
            "跟进和回访： 定期跟进客户，确保问题得到妥善处理，以及回访客户以获取反馈。\n" +
            "\n" +
            "处理客户数据： 管理和保护客户数据，确保遵守相关隐私法规。\n" +
            "\n" +
            "协作与协调： 与其他部门协作，以解决复杂的客户问题，例如物流、财务或产品团队。\n" +
            "\n" +
            "提高服务质量： 不断寻求提高客户支持服务的方法，提高效率和质量。\n" +
            "\n" +
            "应急管理： 在紧急情况下，处理客户问题，提供紧急支持和解决方案。\n" +
            "\n" +
            "作为客服代表，关键是提供出色的客户体验，解决问题，并确保客户对公司的产品或服务感到满意。",
    },
    {
        keywordsId:1,
        keywords: ["怪虫机器人公司待遇","公司待遇","公司待遇怎么样","待遇问题","怪虫待遇"],
        message:"我们公司的待遇非常好，怪虫机器人公司积极支持员工的职业发展，为他们提供广泛的培训和晋升机会，帮助员工不断提升技能和知识。此外，公司致力于为员工提供全面的福利待遇，包括五险一金，涵盖社会保险、医疗保险、养老金、失业保险和工伤保险，以及住房公积金。公司还设有激励计划，包括奖金和股权激励，以激励员工为公司的目标和成功做出杰出贡献。" +
            "怪虫机器人公司非常重视员工的健康和福祉，提供全面的医疗保险覆盖，设有先进的健身设施，以及心理健康支持，确保员工在工作和生活方面都能得到充分的支持。公司的使命是建立一个充满机会和关怀的工作环境，以帮助员工实现个人和职业的成功。",
    },
    {
        keywordsId:1,
        keywords: ["怪虫公司是什么时候成立的","公司成立时间","公司啥时候成立的"],
        message:"怪虫机器人公司成立于2018年，专注于太阳能板清洁领域的高科技企业。",
    },
    {
        keywordsId:1,
        keywords: ["光伏系列的产品名为什么叫堒","产品名为什么叫堒","产品名字为什么叫坤"],
        message:"怪虫的价值观：敬畏自然、敬畏科学、坚持真理（Reverence for nature and veneration for Science，Keep wondering universal nature）英文的首字母组成“KWUN”，音译为“堒”。",
    },
    {
        keywordsId:1,
        keywords: ["为什么选择了怪虫这个奇特的名字","公司名字为什么这么奇怪","奇怪的公司名字"],
        message:"公司取名“怪虫”寓意着我们的创新和突破性思维，以不拘一格的方法解决清洁领域难题，突显我们的创造力和独特性。",
    },
    {
        keywordsId:1,
        keywords: ["堒应该怎么读","堒怎么读","堒的拼音"],
        message:"堒”读作“kūn”，它是怪虫机器人公司光伏系列产品的中文名称，象征着清洁与创新的融合。",
    },
    {
        keywordsId:1,
        keywords: ["公司产品销量","公司机器人销量","产品销量","销量"],
        message:"怪虫机器人在国内外市场中取得了积极的销售业绩，产品备受认可，为全球客户提供了高效可靠的太阳能板清洁解决方案。",
    },
    {
        keywordsId:1,
        keywords: ["怪虫在国外市场的销售状况如何","公司机器人销量","公司产品销量","公司产在国外的销量"],
        message:"怪虫机器人在国外市场取得了积极的销售业绩，产品备受认可，为全球客户提供了高效可靠的太阳能板清洁解决方案。",
    },
    {
        keywordsId:1,
        keywords: ["人工客服"],
        message:"https://work.weixin.qq.com/kfid/kfcbc3ea8617440b578",
    },
    {
        keywordsId:1,
        keywords: ["造物主"],
        message:"hcg2077@163.com",
    },
]








/*数组类型的关键词*/
// @ts-ignore
let keywordsList = []
let keywordsMap = new Map()



keywords.forEach((key,index)=>{
    key.keywordsId=index
    keywordsMap.set(key.keywordsId,key)
    keywordsList.push(key.keywords)
})



export default {
    // @ts-ignore
    keywordsList,keywords,keywordsMap
}
